- test veritabanınızda employee isimli sütun bilgileri id(INTEGER), name VARCHAR(50), birthday DATE, email VARCHAR(100) olan bir tablo oluşturalım.

In [ ]:
CREATE TABLE employee (
	id INTEGER,
	name VARCHAR(50),
	birhday DATE,
	email VARCHAR(100)
);

### 

- Oluşturduğumuz employee tablosuna 'Mockaroo' servisini kullanarak 50 adet veri ekleyelim.

In [ ]:
insert into employee (id, name, birthday, email) values (1, 'Frank Yashaev', '27-03-1974', 'fyashaev0@slashdot.org');
insert into employee (id, name, birthday, email) values (2, 'Bibbie Corss', '13-10-1905', 'bcorss1@statcounter.com');
insert into employee (id, name, birthday, email) values (3, 'Eulalie Gronauer', null, 'egronauer2@opensource.org');
insert into employee (id, name, birthday, email) values (4, 'Louie Maypole', '01-03-1948', 'lmaypole3@japanpost.jp');
insert into employee (id, name, birthday, email) values (5, 'Syman Vanichkin', '25-09-1948', 'svanichkin4@vimeo.com');
insert into employee (id, name, birthday, email) values (6, 'Robbie Entwistle', null, 'rentwistle5@wp.com');
insert into employee (id, name, birthday, email) values (7, 'Jared Orwell', null, 'jorwell6@ucoz.com');
insert into employee (id, name, birthday, email) values (8, 'Lindsay Lengthorn', null, 'llengthorn7@state.gov');
insert into employee (id, name, birthday, email) values (9, 'Madelyn Souter', '11-01-1962', 'msouter8@jigsy.com');
insert into employee (id, name, birthday, email) values (10, 'Wallie Leachman', '10-03-1975', 'wleachman9@mit.edu');
insert into employee (id, name, birthday, email) values (11, 'Herold Berthomier', '22-03-1953', 'hberthomiera@springer.com');
insert into employee (id, name, birthday, email) values (12, 'Arlina St. Hill', '13-09-1919', 'astb@dmoz.org');
insert into employee (id, name, birthday, email) values (13, 'Brandy Bradbury', '09-09-1989', 'bbradburyc@friendfeed.com');
insert into employee (id, name, birthday, email) values (14, 'Scarlet Dobsons', '29-05-1904', 'sdobsonsd@i2i.jp');
insert into employee (id, name, birthday, email) values (15, 'Hunt Sandcraft', '14-10-1945', 'hsandcrafte@dmoz.org');
insert into employee (id, name, birthday, email) values (16, 'Maggy Belt', '06-08-1982', 'mbeltf@nih.gov');
insert into employee (id, name, birthday, email) values (17, 'Kerwinn Juris', '28-09-1993', 'kjurisg@networkadvertising.org');
insert into employee (id, name, birthday, email) values (18, 'Ingeborg Butner', null, null);
insert into employee (id, name, birthday, email) values (19, 'Benjamin Luisetti', '28-03-1937', 'bluisettii@miibeian.gov.cn');
insert into employee (id, name, birthday, email) values (20, 'Gerrilee Elcom', '26-06-1949', 'gelcomj@eventbrite.com');
insert into employee (id, name, birthday, email) values (21, 'Wilek Schult', '16-12-1961', 'wschultk@plala.or.jp');
insert into employee (id, name, birthday, email) values (22, 'Oriana Pudden', '14-12-1931', 'opuddenl@examiner.com');
insert into employee (id, name, birthday, email) values (23, 'Noll Caldwall', '07-02-1970', 'ncaldwallm@scribd.com');
insert into employee (id, name, birthday, email) values (24, 'Armand Leaf', '01-08-1909', 'aleafn@ask.com');
insert into employee (id, name, birthday, email) values (25, 'Leta Caldera', '09-10-1902', 'lcalderao@economist.com');
insert into employee (id, name, birthday, email) values (26, 'Norrie Kreuzer', '09-04-1944', 'nkreuzerp@who.int');
insert into employee (id, name, birthday, email) values (27, 'Ara Brager', '23-10-1907', 'abragerq@craigslist.org');
insert into employee (id, name, birthday, email) values (28, 'Koo Allsworth', '05-04-1924', null);
insert into employee (id, name, birthday, email) values (29, 'Aloysius Bather', '05-01-1978', 'abathers@chicagotribune.com');
insert into employee (id, name, birthday, email) values (30, 'Ruprecht Underdown', '23-10-1986', 'runderdownt@1688.com');
insert into employee (id, name, birthday, email) values (31, 'Mace McEwen', null, 'mmcewenu@bing.com');
insert into employee (id, name, birthday, email) values (32, 'Glory McTrustram', '25-01-1918', 'gmctrustramv@eventbrite.com');
insert into employee (id, name, birthday, email) values (33, 'Caspar Eddicott', '19-01-1910', 'ceddicottw@time.com');
insert into employee (id, name, birthday, email) values (34, 'Velma Tummons', '08-07-1943', 'vtummonsx@blogspot.com');
insert into employee (id, name, birthday, email) values (35, 'Stanfield Crickett', '12-08-1963', 'scricketty@icq.com');
insert into employee (id, name, birthday, email) values (36, 'Rubetta Trunchion', '26-09-1972', 'rtrunchionz@t-online.de');
insert into employee (id, name, birthday, email) values (37, 'Sandy Delves', null, 'sdelves10@mapy.cz');
insert into employee (id, name, birthday, email) values (38, 'Atlanta Saben', '29-01-1939', 'asaben11@google.ca');
insert into employee (id, name, birthday, email) values (39, 'Jen Rosentholer', '28-04-1954', 'jrosentholer12@sun.com');
insert into employee (id, name, birthday, email) values (40, 'Jammal Langhorne', '31-08-1961', 'jlanghorne13@wikimedia.org');
insert into employee (id, name, birthday, email) values (41, 'Casper Pylkynyton', '01-05-1945', 'cpylkynyton14@zdnet.com');
insert into employee (id, name, birthday, email) values (42, 'Kennith Mapplebeck', null, 'kmapplebeck15@skype.com');
insert into employee (id, name, birthday, email) values (43, 'Gilbertine Blakeway', null, 'gblakeway16@phoca.cz');
insert into employee (id, name, birthday, email) values (44, 'Engracia Leggen', '11-01-1921', 'eleggen17@com.com');
insert into employee (id, name, birthday, email) values (45, 'Ludwig MacCafferty', '09-09-1919', 'lmaccafferty18@geocities.jp');
insert into employee (id, name, birthday, email) values (46, 'Alyse Griffith', '15-04-1938', 'agriffith19@economist.com');
insert into employee (id, name, birthday, email) values (47, 'Karolina Padson', '18-03-1988', 'kpadson1a@typepad.com');
insert into employee (id, name, birthday, email) values (48, 'Tillie Dmiterko', '15-10-1964', 'tdmiterko1b@mit.edu');
insert into employee (id, name, birthday, email) values (49, 'Alley Wanka', '30-09-1953', 'awanka1c@slashdot.org');
insert into employee (id, name, birthday, email) values (50, 'Aristotle Jurkiewicz', '09-01-1954', null);

### 

- Sütunların her birine göre diğer sütunları güncelleyecek 5 adet UPDATE işlemi yapalım.

In [ ]:
UPDATE employee 
SET name = 'John Doe'
WHERE id = 1;

UPDATE employee
SET birthday = '01-01-1901'
WHERE name = 'John Doe';

UPDATE employee
SET email = 'ozlem@gokkaya.com'
WHERE birthday = '01-01-1901';

UPDATE employee
SET name = 'Melisa Kaya'
WHERE email = 'ozlem@gokkaya.com';

UPDATE employee
SET birthday = '07-09-2002'
WHERE name = 'Melisa Kaya';

### 

- Sütunların her birine göre ilgili satırı silecek 5 adet DELETE işlemi yapalım.

In [7]:
DELETE FROM employee
WHERE id = 1;

DELETE FROM employee
WHERE name = 'John Doe';

DELETE FROM employee
WHERE email = 'ozlem@gokkaya.com';

DELETE FROM employee
WHERE birthday = '01-01-1901';

DELETE FROM employee
WHERE name = 'Melisa Kaya';